[
  {
    "id": 28756,
    "company": "Anduril Industries",
    "title": "Supplier Quality Engineer, Precision Parts",
    "source_url": "https://boards.greenhouse.io/andurilindustries/jobs/4925201007?gh_jid=4925201007",
    "location": "Atlanta, Georgia, United States",
    "employment_type": "Full time",
    "description": "New\nSupplier Quality Engineer, Precision Parts\nAtlanta, Georgia, United States\nApply\n\nAnduril Industries is a defense technology company with a mission to transform U.S. and allied military capabilities with advanced technology. By bringing the expertise, technology, and business model of the 21st century’s most innovative companies to the defense industry, Anduril is changing how military systems are designed, built and sold. Anduril’s family of systems is powered by Lattice OS, an AI-powered operating system that turns thousands of data streams into a realtime, 3D command and control center. As the world enters an era of strategic competition, Anduril is committed to bringing cutting-edge autonomy, AI, computer vision, sensor fusion, and networking technology to the military in months, not years.\n\nABOUT THE JOB\n\nAs a Supplier Quality Engineer, you will work inside & outside the organization to define, develop, and execute processes that deliver high quality & reliable, precision mechanical parts and sub-assembly used in our aerial drone products and core technology. The applications will range from our Road Runner product to our core technology products that are critical to Anduril's product road map. This role focuses on collaborating and driving early engagement with our design teams and suppliers to meet our quality requirements the first time for mechanical components that require precision machining and forming technologies to achieve the design intent. Everything comes down to clarity and action with our suppliers and partnering with them for world class results is essential across the supply chain. The right person for this role has knowledge of manufacturing, supply management, supplier development, sub- system performance criteria and metrology, and continuous improvement. If you are someone who loves to build world-class quality processes with suppliers, work hands-on with engineering, and be accountable for results, then this role is for you.\n\nWHAT YOU’LL DO\nPartner with our design teams to support the design development process, provide design for manufacturability feedback, and help generate product data (CAD features, drawings details, BOM information, and part & material requirements) for supplier quality success.\nDrive the supplier quality development processes throughout the product development stages with the product engineering team through design reviews, supplier process assessment, prototyping, and qualification for components and sub-assemblies for precision mechanical parts. Review supplier processes, equipment, and capabilities to ensure alignment to mechanical & sub-assembly requirements can be achieved. This may include metals, plastics, composites, and additive manufacturing.\nPartner with development engineering, product quality engineering, sourcing engineering, category management and program management to deliver predictable supply to the development programs, production programs, and manage exceptions/containments/deviations for supplier technical performance, particularly in the development phases.\nDrive supplier quality readiness by analyzing key and critical characteristics for drawings and supplier specification, develop measurement systems, and supplier qualification activities (capability analysis, PPAP, FAIR, Audit, inspection development, etc.).\nPartner with Category Management and Sourcing Engineering to drive overall supplier performance for cost, quality, delivery and fulfillment of strategic goals.\nOwn the elimination of supplier risk to improve quality & reliability across the product lifecycle. Utilize audits, readiness reviews, and training & documentation to ensure compliance.\nSupport Root Cause and Corrective Action (RCCA) and Material Review Board (MRB) activities, while owning containments derived from purchased goods. Drive resolution of fitment issues.\nReview supplier effectiveness of actions and share lessons learned across the product team. Drive supplier corrective action and response (SCAR) process.\nAudit the production & Quality Management System at our suppliers, as it pertains to supplier quality and performance. Define and improve required documentation and activities as needed to ensure Anduril’s compliance to flow-down requirements from customers and internal design requirements.\n\nREQUIRED QUALIFICATIONS\n\nBachelor’s degree in Engineering or a similar technical field.\nAlternatively, 5 to 8 years of equivalent work experience.\nExperience Supplier Quality Engineering, Supplier process development, or Manufacturing Engineering experience in precision part manufacturing and mechanical sub-assy processes.\nExperience evaluating mechanical part manufacturing process such as fixture design, work-piece holding, CNC machining, turning, EDM, multi- axis processing, laser cutting, in-machine metrology, secondary operations for processing parts, etc..\nMechanical:\nASME Y14.5: Defines symbols, definitions, and rules for GD&T.\nASME Y14.3: Covers multi-view and sectional view drawings.\nASME Y14.41: Addresses digital product definition using CAD models.\nExperience flowing down Source Control requirements, and performing source inspection at mechanical manufacturing suppliers. Aerospace, aviation, and previous defense suppliers is a plus.\nWorking knowledge of AS9100/ ISO 9001-based Quality Management System requirements. AS9100 Lead / Internal Auditor Certification is a plus.\nExperience performing First Article Inspection to AS9102 Industry Standard and ensuring suppliers have control plans and inspection processes that are capable of meeting product requirements.\nExperience with driving supplier performance and evaluation. Experience with Statement of Work (SOW), quality clauses, intellectual property (IP), and government regulations such as ITAR, etc..\nWorking knowledge of product development methodologies such as Failure Modes and Effects Analysis (FMEA), Advanced Product Quality Planning (APQP), Production Part Approval Process (PPAP) elements such as Measurement Systems Analysis (MSA), quality improvement techniques, and Geometric Dimensioning and Tolerancing (GD&T).\nA strong ownership mindset with demonstrated capability to drive projects from start to completion.\nAnalytical skills and experiences for data mining, data quality, metrics generation, issue management systems, and statistical analysis tools (MatLab, JMP, MiniTab, etc).\nMust be able to obtain and hold a U.S. TS/SCI security clearance.\nMust be able to travel up to 50% of the time to suppliers, sourcing partners, and manufacturing locations.\n\nPREFERRED QUALIFICATIONS\n\nExperience in creating material and process specifications for mechanical parts and sub-assemblies. Experience in machine qualification and development of automated inspection operations.\nProcess Failure Modes Effects and Analysis (PFMEA) experience and developing source inspection plans and qualifying the inspection process capabilities.\nExperience with government contracts and MIL standard requirements.\nExperience with Teamcenter, SolidWorks, Oracle/Netsuite, Jira, Tableau, and Foundry.\n\n \n\nUS Salary Range\n\n$113,000 - $134,000 USD\n\n \n\nThe salary range for this role is an estimate based on a wide range of compensation factors, inclusive of base salary only. Actual salary offer may vary based on (but not limited to) work experience, education and/or training, critical skills, and/or business considerations. Highly competitive equity grants are included in the majority of full time offers; and are considered part of Anduril's total compensation package. Additionally, Anduril offers top-tier benefits for full-time employees, including: \n\nHealthcare Benefits \n\nUS Roles: Comprehensive medical, dental, and vision plans at little to no cost to you. \nUK & AUS Roles: We cover full cost of medical insurance premiums for you and your dependents. \nIE Roles: We offer an annual contribution toward your private health insurance for you and your dependents. \n\nAdditional Benefits \n\nIncome Protection: Anduril covers life and disability insurance for all employees. \nGenerous time off: Highly competitive PTO plans with a holiday hiatus in December. Caregiver & Wellness Leave is available to care for family members, bond with a new baby, or address your own medical needs. \nFamily Planning & Parenting Support: Coverage for fertility treatments (e.g., IVF, preservation), adoption, and gestational carriers, along with resources to support you and your partner from planning to parenting. \nMental Health Resources: Access free mental health resources 24/7, including therapy and life coaching. Additional work-life services, such as legal and financial support, are also available. \nProfessional Development: Annual reimbursement for professional development \nCommuter Benefits: Company-funded commuter benefits based on your region. \nRelocation Assistance: Available depending on role eligibility. \n\nRetirement Savings Plan \n\nUS Roles: Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options. \nUK & IE Roles: Pension plan with employer match. \nAUS Roles: Superannuation plan. \n\nThe recruiter assigned to this role can share more information about the specific compensation and benefit details associated with this role during the hiring process.",
    "benefits": "US Roles: Traditional 401(k), Roth, and after-tax (mega backdoor Roth) options.\nUK & IE Roles: Pension plan with employer match.\nAUS Roles: Superannuation plan.",
    "requirements": "Experience with Teamcenter, SolidWorks, Oracle/Netsuite, Jira, Tableau, and Foundry.\nUS Salary Range\n$113,000 - $134,000 USD",
    "responsibilities": "WHAT YOU’LL DO",
    "work_environment": null,
    "salary_range": "Not specified",
    "salary_min": null,
    "salary_max": null
  },
  {
    "id": 28702,
    "company": "Waymark",
    "title": "Behavioral Health Therapist (LCPC, LMFT, or LCSW) - Ohio",
    "source_url": "https://job-boards.greenhouse.io/waymark/jobs/4613736005",
    "location": "Ohio - Remote",
    "employment_type": "Full time",
    "description": "Back to jobs\nNew\nBehavioral Health Therapist (LCPC, LMFT, or LCSW) - Ohio\nOhio - Remote\nApply\n\nAbout Waymark\n\nWaymark is a mission-driven team of healthcare providers, technologists, and builders working to transform care for people with Medicaid benefits. We partner with communities to deliver technology-enabled, human-centered support that helps patients stay healthy and thrive. We’re designing tools and systems that bring care directly to those who need it most—removing barriers and reimagining what’s possible in Medicaid healthcare delivery.\n\nOur Values\n\nAt Waymark, our values are the foundation of how we work, grow, and support one another:\n\nBold Builders: We tackle the toughest challenges in care delivery by harnessing the power of community and technology.\nHumble Learners: We seek feedback, embrace diverse perspectives, and welcome challenges to our assumptions.\nExperiment to Improve: We use data to inform decisions and continuously assess our performance.\nFocused Urgency: Our mission drives us to act swiftly and relentlessly in pursuit of meaningful results.\n\nIf this resonates with you, we invite you to bring your creativity, energy, and curiosity to Waymark.\n\nAbout this Role\n\nAs a behavioral health therapist, you will be a core member of a multidisciplinary care team that seeks to redefine care delivery to patients receiving Medicaid. You will provide remote mental health counseling to patients who experience a range of behavioral health conditions. You are expected be competent at triaging patients to an appropriate level of care and deploying evidence-based behavioral health treatment modalities (e.g., cognitive behavioral therapy [CBT], problem solving treatment [PST], solution-focused behavioral therapy [SFBT], acceptance and commitment therapy [ACT]) via a single session approach and intermediate-duration treatment relationship (i.e. three to four months).\n\nIn addition to providing direct patient care, you will participate in outreach to individuals at high risk of behavioral health care needs, coordinate with Waymark’s interdisciplinary care team (community health workers, pharmacists, care coordinators), assist patients’ primary care teams and build relationships with community behavioral health resources.\n\nKey Responsibilities & Duties \n\nDeliver psychosocial treatments and behavioral interventions for disorders common in the Medicaid population and amenable to remote behavioral health treatment (e.g., treatment for depressive and anxiety disorders, trauma, insomnia, chronic pain, substance use disorder etc.) via evidence-based time-limited therapeutic relationships\nProvide direct telephonic and SMS-based outreach to individuals on Medicaid who are likely to benefit from behavioral health support (e.g., following recent behavioral health admission)\nHelp CHWs, pharmacists and care coordinators apply simple behavioral health tools (e.g., motivational interviewing) to support patients’ behavioral changes\nTriage behavioral health needs as they arise (e.g., reports of suicidal ideation)\nCollaborate with community partners and stakeholders (e.g., primary care providers, psychiatrists) to help patients receive comprehensive care\n\nRequired Qualifications \n\nDeep commitment to improving healthcare for underserved populations.\n2+ years post-Master’s-degree experience delivering evidence-based psychosocial treatments to patients with behavioral health needs. \nAlignment with Waymark’s core mission and values\nLicensed Mental Health Counselor (LMHC) or Licensed Professional Counselor (LPC) or Licensed Clinical Professional Counselor (LCPC) or Licensed Marriage and Family Therapist (LMFT) or Licensed Independent  Social Worker (LISW)\nDemonstrated ability to collaborate and communicate in writing, in-person and virtually in a multidisciplinary team setting.\n\nPreferred Qualifications\n\nExperience supporting underserved populations with a spectrum of behavioral health needs.\nExperience in community mental health, hospital/medical social work, inpatient behavioral health, or case management\nExperience and familiarity with behavioral health services in the Greater Cleveland/Canton/Akron area\nExperience delivering single session interventions (also known as single session therapy, single session thinking or single session consultations)\n3+ years experience delivering CBT, DBT, PST, SFBT, or ACT\nFamiliarity with the Collaborative Care Model of care\n\nSalary Range\n\n$71,000 - $82,900\n\nIn addition to salary, we offer a comprehensive benefits package. Here’s what you can expect:\n\nStock Options: Opportunity to invest in the company’s growth.\nWork-from-Home Stipend: A dedicated stipend for your first year to help set up your home office.\nMedical, Vision, and Dental Coverage: Comprehensive plans to keep you and your family healthy.\nLife Insurance: Basic life insurance to give you peace of mind.\nPaid Time Off: 20 vacation days, accrued over the year, plus 11 paid holidays.\nParental Leave: 16 weeks of paid leave for birthing parents after six months of employment, and 8 weeks of bonding leave for non-birthing parents.\nRetirement Savings: Access to a 401(k) plan with a company contribution, subject to a vesting schedule.\nCommuter Benefits: Convenient options to support your commute needs.\nProfessional Development Stipend: A dedicated stipend supports professional development and growth.\n\nOffer of employment is contingent upon successful completion of a background check.\n\nDon’t check off every box in the requirements listed above? Please apply anyway! Studies have shown that some of us may be less likely to apply to jobs unless we meet every single qualification. Waymark is dedicated to building a supportive, equal opportunity, and accessible workplace that fosters a sense of belonging – so if you’re excited about this role but your past experience doesn’t align perfectly with every preferred qualification in the job description, we encourage you to still consider submitting an application. You may be just the right candidate for this role or another one of our openings!",
    "benefits": "Offer of employment is contingent upon successful completion of a background check.",
    "requirements": "Experience supporting underserved populations with a spectrum of behavioral health needs.\nExperience in community mental health, hospital/medical social work, inpatient behavioral health, or case management\nExperience and familiarity with behavioral health services in the Greater Cleveland/Canton/Akron area\nExperience delivering single session interventions (also known as single session therapy, single session thinking or single session consultations)\n3+ years experience delivering CBT, DBT, PST, SFBT, or ACT\nFamiliarity with the Collaborative Care Model of care\nSalary Range\n$71,000 - $82,900",
    "responsibilities": null,
    "work_environment": "Provide direct telephonic and SMS-based outreach to individuals on Medicaid who are likely to benefit from behavioral health support (e.g., following recent behavioral health admission)\nHelp CHWs, pharmacists and care coordinators apply simple behavioral health tools (e.g., motivational interviewing) to support patients’ behavioral changes\nTriage behavioral health needs as they arise (e.g., reports of suicidal ideation)\nCollaborate with community partners and stakeholders (e.g., primary care providers, psychiatrists) to help patients receive comprehensive care",
    "salary_range": "Not specified",
    "salary_min": null,
    "salary_max": null
  }
]